cask_args appdir: '/Applications'

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
tap 'caskroom/fonts'
# Uncomment if want to use beta version of apps
#tap caskroom/versions

# Install ZSH
#brew 'zsh'
#brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
#brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
#brew 'findutils'

# Install Bash 4
#brew 'bash'

# Install more recent versions of some macOS tools
#brew 'grep'

# Install Binaries
#brew 'awscli'
#brew 'git'
#brew 'hub'
#brew 'tree'
#brew 'mackup'
#brew 'mas'
#brew 'trash'
#brew 'ack'
#brew 'coreutils'
brew 'go'
#brew 'grc'
#brew 'imagemagick'
#brew 'jp2a'
#brew 'jq'
#brew 'libcaca', args: ['with-imlib2']
#brew 'libgit2'
#brew 'openssl'
#brew 'node'
#brew 'readline'
#brew 'postgresql'
#brew 'puma/puma/puma-dev'
#brew 'ruby-build'
#brew 'rbenv'
#brew 'roundup'
#brew 'spaceman-diff'
#brew 'spark'
brew 'unrar'
#brew 'wget'
#brew 'yarn'
brew 'youtube-dl'
brew 'tig'
brew 'gradle'
brew 'tmux'
brew 'midnight-commander'
brew 'dep' #Go dependency management tool

# Development
#brew 'php'
#brew 'php72-imagick'
#brew 'mysql'

# Apps
#cask 'aerial'
#cask 'alfred'
#cask 'caffeine'
#cask 'docker'
#cask 'eid-be'
#cask 'eid-be-viewer'
#cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-featured-photos'
#cask 'gpgtools'
#cask 'grammarly'
#cask 'insomnia'
cask 'iterm2'
cask 'java'
#cask 'mysqlworkbench'
#cask 'now'
#cask 'phpstorm'
#cask 'quip'
#cask 'sequel-pro'
#cask 'shuttle'
#cask 'slack'
#cask 'sublime-text'
#cask 'torbrowser'
#cask 'tower'
#cask 'transmit'
#cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'vlc'
#cask 'zoomus'
cask '1password'
#cask 'adium'
#cask 'atom'
#cask 'firefox'
#cask 'garmin-express'
#cask 'handbrake'
#cask 'mapbox-studio'
#cask 'seashore'
#cask 'slack'
#cask 'steam'
#cask 'transmission'
#cask 'tunnelbear'
cask 'android-studio'
cask 'android-sdk'
cask 'caskroom/versions/java8'
cask 'skype'
cask 'dropbox'

# Quicklook
#cask 'qlcolorcode'
#cask 'qlmarkdown'
#cask 'quicklook-json'
#cask 'quicklook-csv'
#cask 'qlstephen'

# Fonts
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'
cask 'font-inconsolata'

# Install Mac App Store apps
mas 'Magnet', id: 441258766
mas 'Xcode', id: 497799835
#mas '1Password', id: 443987910
#mas 'Byword', id: 420212497
#mas 'Deckset', id: 847496013
#mas 'Gapplin', id: 768053424
#mas 'Giphy Capture', id: 668208984
#mas 'Paw', id: 584653203
#mas 'Sip', id: 507257563
#mas 'Sketch', id: 402476602
#mas 'Spark', id: 1176895641
#mas 'The Unarchiver', id: 425424353
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 557168941
#mas 'Unsplash Wallpapers', id: 1284863847
#mas 'WhatsApp', id: 1147396723 
